/**
 * Created by q on 22.02.2016.
 */


var AutoitCommand  = new MobitvaBotAutoitCommand();
var MobitvaBot     = new MobitvaAtomBot();
var LocationsGraph = new Graph();


for (var key in locationList) {
    for (var ind in locationList[key].locationNamesList) {
        LocationsGraph.addRoute(locationList[key].name, locationList[key].locationNamesList[ind], 0.5);
    }
}

/** Дебаг. локации **/

         // LocationsGraph.init(
         //	{
         //		"nodes" : ["ярмарка", "вирастоль", "проселок", "тракт", "чернолесье", "стагород", "гати", "мавкина_роща", "погост", "зябкое_ущелье", "поместье_раввика", "слободка",
         //		           "коллектор", "верхний_город", "гнилая_топь", "ящеркин_хутор", "мертвый_каньон", "малые_пупыри", "потайной_ход", "терем_раввика", "лавка_контрабанды",
         //		           "коридор_катакомб", "мастер_рун", "пешера_древних", "лес_духов", "пешера_стеклодувов", "похоронный_зал", "северный_коридор", "южный_коридор", "плачущее_озеро",
         //		           "древний_храм"],
         //		"matrix": [[0.1, 0.5, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999],
         //		           [0.5, 0.1, 0.5, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999],
         //		           [999, 0.5, 0.1, 0.5, 0.5, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999],
         //		           [999, 999, 0.5, 0.1, 999, 0.5, 0.5, 0.5, 0.5, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999],
         //		           [999, 999, 0.5, 999, 0.1, 999, 999, 999, 999, 999, 999, 999, 999, 999, 0.5, 0.5, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999],
         //		           [999, 999, 999, 0.5, 999, 0.1, 999, 999, 999, 0.5, 0.5, 0.5, 0.5, 0.5, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999],
         //		           [999, 999, 999, 0.5, 999, 999, 0.1, 999, 999, 999, 999, 999, 999, 999, 0.5, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999],
         //		           [999, 999, 999, 0.5, 999, 999, 999, 0.1, 999, 999, 999, 999, 999, 999, 999, 0.5, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999],
         //		           [999, 999, 999, 0.5, 999, 999, 999, 999, 0.1, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999],
         //		           [999, 999, 999, 999, 999, 0.5, 999, 999, 999, 0.1, 999, 999, 999, 999, 999, 999, 0.5, 0.5, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999],
         //		           [999, 999, 999, 999, 999, 0.5, 999, 999, 999, 999, 0.1, 999, 999, 999, 999, 999, 999, 999, 0.5, 0.5, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999],
         //		           [999, 999, 999, 999, 999, 0.5, 999, 999, 999, 999, 999, 0.1, 999, 999, 999, 999, 999, 999, 999, 999, 0.5, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999],
         //		           [999, 999, 999, 999, 999, 0.5, 999, 999, 999, 999, 999, 999, 0.1, 999, 999, 999, 999, 999, 999, 999, 999, 0.5, 999, 999, 999, 999, 999, 999, 999, 999, 999],
         //		           [999, 999, 999, 999, 999, 0.5, 999, 999, 999, 999, 999, 999, 999, 0.1, 999, 999, 999, 999, 999, 999, 999, 999, 0.5, 999, 999, 999, 999, 999, 999, 999, 999],
         //		           [999, 999, 999, 999, 0.5, 999, 0.5, 999, 999, 999, 999, 999, 999, 999, 0.1, 0.5, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999],
         //		           [999, 999, 999, 999, 0.5, 999, 999, 0.5, 999, 999, 999, 999, 999, 999, 0.5, 0.1, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999],
         //		           [999, 999, 999, 999, 999, 999, 999, 999, 999, 0.5, 999, 999, 999, 999, 999, 999, 0.1, 999, 999, 999, 999, 999, 999, 0.5, 0.5, 0.5, 999, 999, 999, 999, 999],
         //		           [999, 999, 999, 999, 999, 999, 999, 999, 999, 0.5, 999, 999, 999, 999, 999, 999, 999, 0.1, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999],
         //		           [999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 0.5, 999, 999, 999, 999, 999, 999, 999, 0.1, 999, 999, 999, 999, 999, 999, 999, 0.5, 999, 999, 999, 999],
         //		           [999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 0.5, 999, 999, 999, 999, 999, 999, 999, 999, 0.1, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999],
         //		           [999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 0.5, 999, 999, 999, 999, 999, 999, 999, 999, 0.1, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999],
         //		           [999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 0.5, 999, 999, 999, 999, 999, 999, 999, 999, 0.1, 999, 999, 999, 999, 999, 0.5, 0.5, 999, 999],
         //		           [999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 0.5, 999, 999, 999, 999, 999, 999, 999, 999, 0.1, 999, 999, 999, 999, 999, 999, 999, 999],
         //		           [999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 0.5, 999, 999, 999, 999, 999, 999, 0.1, 999, 999, 999, 999, 999, 999, 999],
         //		           [999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 0.5, 999, 999, 999, 999, 999, 999, 999, 0.1, 999, 999, 999, 999, 0.5, 999],
         //		           [999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 0.5, 999, 999, 999, 999, 999, 999, 999, 999, 0.1, 999, 999, 999, 999, 999],
         //		           [999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 0.5, 999, 999, 999, 999, 999, 999, 999, 0.1, 0.5, 0.5, 999, 0.5],
         //		           [999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 0.1, 999, 999, 999],
         //		           [999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 0.1, 999, 999],
         //		           [999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 0.1, 999],
         //		           [999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 999, 0.1]]
         //	}
         //);

var locationScreen = (new AtomBotScreen('локация', ['иконка_уровень', 'иконка_хп', 'рамка_картинки_локации']));

for (key in locationList) {
    locationScreen.addSubScreen((new AtomBotScreen('локация_' + locationList[key].name, ['табличка_локации_' + locationList[key].name]))
        .addParam('location', locationList[key].name)
        .addParam('is_red', false)
        .addSubScreen((new AtomBotScreen('локация_' + locationList[key].name + '_дуэли_красная', ['кнопка_красная_Дуэли']))
            .addParam('location', locationList[key].name)
            .addParam('is_red', true)
        ));
}

/**
 * Список знакомых боту экранов (для распозравания)
 * @type {*[]}
 */
var screenList = [

    (new AtomBotScreen('бой', ['кнопки_атаки_верх', 'кнопки_атаки_низ'])),
    (new AtomBotScreen('неопознанный_экран[кнопка_да_зеленая]', ['кнопка_да_зеленая'])),
    (new AtomBotScreen('неопознанный_экран[кнопка_оранжевая_Отклонить]', ['кнопка_оранжевая_Отклонить'])),
    (new AtomBotScreen('неопознанный_экран[кнопка_согласиться]', ['кнопка_согласиться'])),
    (new AtomBotScreen('неопознанный_экран[кнопка_ок_белая]', ['кнопка_ок_белая'])),
    (new AtomBotScreen('неопознанный_экран[кнопка_ок]', ['кнопка_ок']))
        .addSubScreen((new AtomBotScreen('сообщение_белое_куплен', ['сообщение_белое_предмет'])))
    ,
    (new AtomBotScreen('неопознанный_экран[кнопка_далее_f1]', ['кнопка_далее_f1']))
        .addSubScreen((new AtomBotScreen('результаты_боя', ['текст_результаты_имя', 'текст_результаты_опыт', 'текст_результаты_урон'])))
        .addSubScreen((new AtomBotScreen('результаты_боя', ['текст_результаты'])))
    ,
    (new AtomBotScreen('неопознанный_экран[кнопка_далее]', ['кнопка_далее']))
        .addSubScreen((new AtomBotScreen('сообщение_выносливость', ['сообщение_выносливость'])))
    ,
    (new AtomBotScreen('неопознанный_экран[кнопка_оранжевая_Да]', ['кнопка_оранжевая_Да']))
        .addSubScreen((new AtomBotScreen('сообщение_грабеж', ['сообщение_белое_Вас хотят ограбить'])))
        .addSubScreen((new AtomBotScreen('сообщение_добавление_в_друзья', ['сообщение_белое_хочет', 'сообщение_белое_добавить', 'сообщение_белое_друзья'])))
        .addSubScreen((new AtomBotScreen('сообщение_приглашение_в_клан', ['сообщение_белое_приглашает', 'сообщение_белое_клан'])))
    ,
    (new AtomBotScreen('неопознанный_экран[кнопка_назад_f2]', ['кнопка_назад_f2']))
        .addSubScreen((new AtomBotScreen('охота', ['кнопка_текущие', 'текст_охота'])))
        .addSubScreen((new AtomBotScreen('охота_атаковать', ['кнопка_атаковать'])))
        .addSubScreen((new AtomBotScreen('магазин', ['кнопка_премиум'])))
        .addSubScreen((new AtomBotScreen('магазин_каталог', ['текст_уровень', 'текст_цена'])))
        .addSubScreen((new AtomBotScreen('магазин_карточка_товара', ['текст_купить']))
            .addSubScreen((new AtomBotScreen('магазин_карточка_товара_вигор', ['текст_Жидкость', 'текст_восстанавливающая'])).addParam('item', 'вигор')))
        .addSubScreen((new AtomBotScreen('дуэли', ['текст_жирный_начать', 'текст_жирный_поединок'])))
        .addSubScreen((new AtomBotScreen('дуэли_ожидание_противника', ['текст_Ожидаем ответа противника'])))

        .addSubScreen((new AtomBotScreen('турнир', ['кнопка_стенка', 'кнопка_выживание'])))
        .addSubScreen((new AtomBotScreen('турнир_стенка_выбор_взноса', ['текст_стенка', 'текст_стенку', 'кнопка_просмотреть'])))
        .addSubScreen((new AtomBotScreen('турнир_выживание_выбор_взноса', ['текст_выживание', 'кнопка_просмотреть'])))

        .addSubScreen((new AtomBotScreen('турнир_стенка_регистрация', ['текст_жирный_минимум', 'текст_каждой', 'текст_золотой'])))
        .addSubScreen((new AtomBotScreen('турнир_выживание_регистрация', ['текст_жирный_минимум', 'текст_золотой'])))


        .addSubScreen((new AtomBotScreen('грабежи', ['кнопка_оранжевая_Текущие', 'кнопка_оранжевая_Напасть'])))
        .addSubScreen((new AtomBotScreen('грабежи_ожидание_противника', ['stealing_search_opponent'])))

        .addSubScreen((new AtomBotScreen('клан', ['кнопка_оранжевая_Чат', 'кнопка_коричневая_Меню клана']))
            .addSubScreen((new AtomBotScreen('клан_грабежи_красные', ['кнопка_красная_Грабежи']))))

        .addSubScreen((new AtomBotScreen('клан_грабежи_текущие_красные', ['кнопка_красная_Текущие'])))

        .addSubScreen((new AtomBotScreen('вмешательство_список_боев', ['текст_vs', 'герб_красный', 'герб_синий', 'кнопка_коричневая_Обновить']))
            .addSubScreen((new AtomBotScreen('вмешательство_просмотр_состава', ['текст_вмешаться']))))
    ,
    locationScreen,
    (new AtomBotScreen('бой_персонаж_погиб', ['кнопка_выйти']))
];

// Инициализируем бота.
MobitvaBot.init(screenList, LocationsGraph, locationList);
